<?php
/**
 * Created by PhpStorm.
 * User: Gavin
 * Date: 2016/11/10
 * Time: 14:49
 */

/**
 * 错误码
 */
return [

    // 用户相关问题
    1001 => '用户不存在',
    1002 => '店铺不存在',
    1003 => '商品不存在',
    1004 => '分类不存在',
	1005 => '某商品库存不足',
	1006 => '支付超时，订单已关闭',
	1007 => '该订单已提醒',

    1010 => '购物车无此商品',

    1020 => '没有指定的订单商品',
    1021 => '评价已回复',
    1022 => '买家未评价',

    // 调用方式错误
    2001 => '参数不正确',
    2002 => 'url无法解析',
    2003 => '没有指定action',
    2004 => '参数无法解析',

    // 系统错误
    3001 => '内部错误',
    3002 => '系统繁忙',
    3003 => '请刷新当前页面',
    3004 => '请重新登录',
    3005 => '登录跳转购物袋',

    -1 => '未知错误'

];